/*
- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write



стоврити масив книжок (назва, кількість сторінок, автори , жанри).
-знайти наібльшу книжку.
- знайти книжку/ки з найбільшою кількістю жанрів
- знайти книжку/ки з найдовшою назвою
- знайти книжку/ки які писали 2 автори
- знайти книжку/ки які писав 1 автор
*/

/*
--створити масив з:
    - з 5 числових значень
    - з 5 стічкових значень
    - з 5 значень стрічкового, числового та булевого типу
    - та вивести його в консоль

    -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
 */

let numbers = [1, 13, 27, 55, 77];

let carBrands = ['BMW', 'Nissan', 'Audi', 'Mazda', 'Kia'];

let players = [
    {
        nickname: 'zeroNess1',
        age: 21,
        status: true
    },
    {
        nickname: 'aRIFureta',
        age: 27,
        status: false
    },
    {
        nickname: 'LegoLas',
        age: 29,
        status: true
    },
    {
        nickname: 'ShaMan',
        age: 30,
        status: true
    },
    {
        nickname: 'Sugar',
        age: 21,
        status: false
    }
];

console.log(numbers, carBrands, players);

/*
- є масив [2,17,13,6,22,31,45,66,100,-18] :
    1. перебрати його циклом while
    2. перебрати його циклом for
    3. перебрати циклом while та вивести  числа тільки з непарним індексом
    4. перебрати циклом for та вивести  числа тільки з непарним індексом
    5. перебрати циклом while та вивести  числа тільки парні  значення
    6. перебрати циклом for та вивести  числа тільки парні  значення
    7. замінити кожне число кратне 3 на слово "okten"
    8. вивести масив в зворотньому порядку.
    9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
 */

//1. перебрати його циклом while
let nums = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

document.write(`<div>`);
let i = 0;
while (i < nums.length) {
    document.write(`${nums[i]}`);
    i++
}
document.write(`</div>`);

//2. перебрати його циклом for
document.write(`<div>`);
for (num of nums) {
    document.write(`${num}`)
}
document.write(`</div>`);

//3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let nums2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

document.write(`<ul>`);
let a = 0;
while (a < nums.length) {
    if (a % 2 !== 0) {
        document.write(`<li>${nums[a]}</li>`);
    }
    a++;
}
document.write(`</ul>`);

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
document.write(`<ul>`);
for (a = 0; a < nums.length; a++) {
    if (a % 2 !== 0) {
        num2 = nums[a];
        document.write(`<li>${num2}</li>`);
    }
}
document.write(`</ul>`);

// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let nums3 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

document.write(`<ul>`);
let b = 0;
while (b < nums.length) {
    if (b % 2 === 0) {
        document.write(`<li>${nums[b]}</li>`);
    }
    b++
}
document.write(`</ul>`);

// 6. перебрати циклом for та вивести  числа тільки парні  значення

document.write(`<ul>`);
for (b = 0; b < nums.length; b++) {
    if (b % 2 === 0) {
        document.write(`<li>${nums[b]}</li>`);
    }
}
document.write(`</ul>`);

// 7. замінити кожне число кратне 3 на слово "okten"
let for3 = [];
for (let num of nums) {
    if (num % 3 === 0) {
        console.log(num);
        num = 'okten';
        for3[for3.length] = num
    }
    console.log(num);
}

// 8. вивести масив в зворотньому порядку.
document.write(`<ul>`);
for (let d = nums.length - 1; d >= 0; d--) {
    document.write(`<li>${nums[d]}</li>`);
}
document.write(`</ul>`);

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
document.write(`<ul>`);
let e = nums.length - 1;
while (e >= 0) {
    document.write(`<li>${nums[e]}</li>`);
    e--;
}
document.write(`</ul>`);

document.write(`<ul>`);
let f = nums.length - 1;
while (f >= 0) {
    if (f % 2 !== 0) {
        document.write(`<li>${nums[f]}</li>`);
    }
    f--;
}
document.write(`</ul>`);

document.write(`<ul>`);
for (let g = nums.length - 1; g >= 0; g--) {
    if (g % 2 !== 0) {
        document.write(`<li>${nums[g]}</li>`);
    }
}
document.write(`</ul>`);

document.write(`<ul>`);
let h = nums.length - 1;
while (h >= 0) {
    if (h % 2 === 0) {
        document.write(`<li>${nums[h]}</li>`);
    }
    h--;
}
document.write(`</ul>`);

document.write(`<ul>`);
for (let k = nums.length - 1; k >= 0; k--) {
    if (k % 2 === 0) {
        document.write(`<li>${nums[k]}</li>`);
    }
}
document.write(`</ul>`);


//// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
//
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор
let books = [
    {
        title: "Ігри розуму",
        pages: 320,
        authors: ["Денніел Канеман", "Амос Тверський"],
        genres: ["психологія", "економіка"]
    },
    {
        title: "Майстер і Маргарита",
        pages: 384,
        authors: ["Михайло Булгаков"],
        genres: ["фантастика", "сатира"]
    },
    {
        title: "Гаррі Поттер і філософський камінь",
        pages: 332,
        authors: ["Джоан Роулінг"],
        genres: ["фентезі", "пригоди"]
    },
    {
        title: "1984",
        pages: 328,
        authors: ["Джордж Орвелл"],
        genres: ["дистопія", "політичний роман"]
    },
    {
        title: "Маленький принц",
        pages: 96,
        authors: ["Антуан де Сент-Екзюпері"],
        genres: ["філософська проза", "пригоди"]
    },
    {
        title: "Таємниця Шерлока Холмса",
        pages: 240,
        authors: ["Артур Конан Дойль"],
        genres: ["детектив", "містика"]
    },
    {
        title: "Над прірвою у темряві",
        pages: 336,
        authors: ["Стивен Кінг"],
        genres: ["трилер", "жахи"]
    },
    {
        title: "Винні Пух",
        pages: 160,
        authors: ["Алан Александр Мілн"],
        genres: ["дитяча література", "пригоди"]
    },
    {
        title: "Тіні забутих предків",
        pages: 416,
        authors: ["Габріель Гарсія Маркес"],
        genres: ["магічний реалізм", "пригоди"]
    },
    {
        title: "Портрет Доріана Грея",
        pages: 272,
        authors: ["Оскар Уайльд"],
        genres: ["філософська проза", "готичний роман"]
    },
];

// -знайти наібльшу книжку.


for (i = 0; i < books.length; ++i) {
    if (books[i] > books["pages"]) {
        continue;
    }
    if (books[i] < books["pages"]) {
        console.log(books["pages"]);
    }
    console.log(books[i], i)
}