/*
- створити функцію яка створює параграф з текстом. Текст задати через аргумент
- створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
- створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
- створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
- створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
- створити функцію яка повертає найменьше число з масиву
- створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
- створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
- Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250
 */

//// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
function rectangle(lth, wth) {
    return lth * wth;
}

let areaRectangle = rectangle(10, 20);
console.log(areaRectangle);

//// - створити функцію яка обчислює та повертає площу кола з радіусом r
function circle(num) {
    let pi = 3.14;
    return pi * (num * num);
}

let areaCircle = circle(5);
console.log(areaCircle);

//// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
function cylinder(rad, hgt) {
    let pi = 3.14;
    return 2 * pi * (rad * rad) + 2 * pi * rad * hgt;
}

let areaCylinder = cylinder(4,7);
console.log(areaCylinder);

//// - створити функцію яка приймає масив та виводить кожен його елемент
