// Завдання 6
//// - Є змінна х, якій ви надаєте довільне числове значення.
////   Якщо змінна x не дорівнює нулю, виведіть 'Вірно',
////   інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let x = +prompt("Введіть число...");
if (x !== 0) {
    console.log('Вірно');
} else {
    console.log('Невірно');
}

// Можете закоментувати нижні значення, щоб зрозуміти де 'Вірно', а де 'Невірно'.

let a = 1;
if (a !== 0) {
    console.log('Вірно')
} else {
    console.log('Невірно')
}

a = 0;
if (a !== 0) {
    console.log('Вірно')
} else {
    console.log('Невірно')
}

a = -1;
if (a !== 0) {
    console.log('Вірно')
} else {
    console.log('Невірно')
}


