// Завдання 9
//// - Скласти розклад на тиждень за домопоги switch.
////   Користувач вводить порядковий номер дня тижня і на екрані відображається інфа,
////   що заплановано на цей день (можна замість плану на день, назву дня англійською).

let timetable = +prompt('Ввестич день тижня від 1 до 7');
switch (timetable) {
    case 1:
        console.log('Понеділок');
        console.log('Ранкова пробіжка. Зустрітись з коханою. Навчання.');
        break;
    case 2:
        console.log('Вівторок');
        console.log('Ранкова пробіжка. Допомогти батькам. Консультація по навчанню');
        break;
    case 3:
        console.log('Середа');
        console.log('Ранкова пробіжка. Побачення. Навчання.');
        break;
    case 4:
        console.log('Четвер');
        console.log('Ранкова пробіжка. Зустріч з батьками дівчини. Навчання.');
        break;
    case 5:
        console.log('П\'ятниця');
        console.log('Ранкова пробіжка. Зустріч з друзями. Навчання.');
        break;
    case 6:
        console.log('Субота');
        console.log('Відпочинок. Курс з англійської мови. Допомогти батькам.');
        break;
    case 7:
        console.log('Неділя');
        console.log('Провести час з друзями і коханою. Переглянути додаткові заняття.');
        break;
    default:
        console.log('Невірно введено день тижня!');
}