// Завдання 7
//// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код,
////   який перевірить, до якої четверті години попадає число
////   (в першу, другу, третю или четверту частину години).

let time = +prompt('Ввести число від 0 до 59');

if  (time >= 0 && time < 15) {
    console.log('Перша частина години');
} else if (time >= 15 && time < 30) {
    console.log('Друга частина години');
} else if (time >= 30 && time < 45) {
    console.log('Третя частина години');
} else if (time >=45 && time < 60) {
    console.log('Четверта частина години');
} else {
    console.log('Помилка, невірне число');
}